{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If this notebook is inside a container, you will need to enable connection with the host\n",
    "\n",
    "<!-- https://forums.docker.com/t/accessing-host-machine-from-within-docker-container/14248/4 -->\n",
    "`docker network create -d bridge --subnet 192.168.0.0/24 --gateway 192.168.0.1 dockernet`\n",
    "\n",
    "`docker run -p 8888:8888 --net=dockernet  -v \"$PWD\":/home/jovyan datasci`\n",
    "\n",
    "I am also running Neo4j from a container:\n",
    "\n",
    "`docker run --publish=7474:7474 --publish=7687:7687 --volume=$HOME/neo4j/data:/data --env=NEO4J_AUTH=none neo4j`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/09/a7/e953ceef9a0e3c007139938b12f4827a248a20f02a0f28f98c6e108a4a93/py2neo-4.2.0.tar.gz (72kB)\n",
      "\u001b[K    100% |████████████████████████████████| 81kB 729kB/s \n",
      "\u001b[?25hCollecting click>=7.0 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/fa/37/45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec/Click-7.0-py2.py3-none-any.whl (81kB)\n",
      "\u001b[K    100% |████████████████████████████████| 81kB 1.0MB/s \n",
      "\u001b[?25hCollecting colorama (from py2neo)\n",
      "  Downloading https://files.pythonhosted.org/packages/4f/a6/728666f39bfff1719fc94c481890b2106837da9318031f71a8424b662e12/colorama-0.4.1-py2.py3-none-any.whl\n",
      "Collecting neobolt<1.8,>=1.7.3 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/ba/02/641c5241db092f75bce1334cb728d3fb48f4dddc5d21401fe94a5ed636ad/neobolt-1.7.4.tar.gz (182kB)\n",
      "\u001b[K    100% |████████████████████████████████| 184kB 654kB/s \n",
      "\u001b[?25hCollecting neotime<1.8,>=1.7.4 (from py2neo)\n",
      "  Downloading https://files.pythonhosted.org/packages/0b/7e/ca368a8d8e288be1352d4e2df35da1e01f8aaffbf526695df71630bcb8a6/neotime-1.7.4.tar.gz\n",
      "Collecting prompt_toolkit<2.1,>=2.0.7 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/f7/a7/9b1dd14ef45345f186ef69d175bdd2491c40ab1dfa4b2b3e4352df719ed7/prompt_toolkit-2.0.9-py3-none-any.whl (337kB)\n",
      "\u001b[K    100% |████████████████████████████████| 337kB 1.1MB/s \n",
      "\u001b[?25hCollecting pygments<2.4,>=2.3.0 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/13/e5/6d710c9cf96c31ac82657bcfb441df328b22df8564d58d0c4cd62612674c/Pygments-2.3.1-py2.py3-none-any.whl (849kB)\n",
      "\u001b[K    100% |████████████████████████████████| 849kB 797kB/s \n",
      "\u001b[?25hRequirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from py2neo) (2018.6)\n",
      "Requirement already satisfied: urllib3[secure]<1.25,>=1.23 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from neotime<1.8,>=1.7.4->py2neo) (1.11.0)\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.6/site-packages (from prompt_toolkit<2.1,>=2.0.7->py2neo) (0.1.7)\n",
      "Requirement already satisfied: pyOpenSSL>=0.14 in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (18.0.0)\n",
      "Requirement already satisfied: cryptography>=1.3.4 in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.5)\n",
      "Requirement already satisfied: idna>=2.0.0 in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.7)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2018.11.29)\n",
      "Collecting ipaddress (from urllib3[secure]<1.25,>=1.23->py2neo)\n",
      "  Downloading https://files.pythonhosted.org/packages/fc/d0/7fc3a811e011d4b388be48a0e381db8d990042df54aa4ef4599a31d39853/ipaddress-1.0.22-py2.py3-none-any.whl\n",
      "Requirement already satisfied: cffi!=1.11.3,>=1.8 in /opt/conda/lib/python3.6/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (1.11.5)\n",
      "Requirement already satisfied: asn1crypto>=0.21.0 in /opt/conda/lib/python3.6/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (0.24.0)\n",
      "Requirement already satisfied: pycparser in /opt/conda/lib/python3.6/site-packages (from cffi!=1.11.3,>=1.8->cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (2.19)\n",
      "Building wheels for collected packages: py2neo, neobolt, neotime\n",
      "  Running setup.py bdist_wheel for py2neo ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/jovyan/.cache/pip/wheels/b2/47/dd/757f7a2f0880b55fda4a7f1f0d6cb10df2de9cd4b14a0c6f47\n",
      "  Running setup.py bdist_wheel for neobolt ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/jovyan/.cache/pip/wheels/29/15/1f/a2d381d5186d84b524791cc3eff45e0e01645a8412e20a1658\n",
      "  Running setup.py bdist_wheel for neotime ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/jovyan/.cache/pip/wheels/d4/b4/c4/ab867cd0ac9e667f8cd269f9364fd1cb8ee75fe50f5ce97c79\n",
      "Successfully built py2neo neobolt neotime\n",
      "Installing collected packages: click, colorama, neobolt, neotime, prompt-toolkit, pygments, py2neo, ipaddress\n",
      "  Found existing installation: prompt-toolkit 2.0.6\n",
      "    Uninstalling prompt-toolkit-2.0.6:\n",
      "      Successfully uninstalled prompt-toolkit-2.0.6\n",
      "  Found existing installation: Pygments 2.2.0\n",
      "    Uninstalling Pygments-2.2.0:\n",
      "      Successfully uninstalled Pygments-2.2.0\n",
      "Successfully installed click-7.0 colorama-0.4.1 ipaddress-1.0.22 neobolt-1.7.4 neotime-1.7.4 prompt-toolkit-2.0.9 py2neo-4.2.0 pygments-2.3.1\n"
     ]
    }
   ],
   "source": [
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://neo4j.com/developer/docker/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4.2.0\n"
     ]
    }
   ],
   "source": [
    "# https://py2neo.org/v4/\n",
    "import py2neo\n",
    "print(py2neo.__version__)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph,Node,Relationship"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "the reason the IP is 192.168.0.1 is because the Neo4j instance is in a container and we are connecting over a Docker network"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph =  Graph(\"http://192.168.0.1:7474/db/data/\",secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",bolt=False,secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",username='neo4j',secure=False)\n",
    "#graph =  Graph(\"http://neo4j:password@localhost:7474/db/data/\") # https://stackoverflow.com/questions/39667425/py2neo-socketerror-connection-refused-but-curl-works"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "mary = Node(\"Person\",name=\"Mary\",primary_key='name',primary_label='Person')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(mary)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a few CYPHER queries that are in Python functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_distinct_labels(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return distinct labels (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record labels (n)=['Person']>\n"
     ]
    }
   ],
   "source": [
    "print_distinct_labels(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def how_many_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return count (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count (n)=1>\n"
     ]
    }
   ],
   "source": [
    "how_many_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_all_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    MATCH (n) \n",
    "    RETURN n limit 100\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_0:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = Node('Person',primary_label=\"Person\", name=\"Alice\",primary_key=5358)\n",
    "b = Node('Person',primary_label=\"Person\", name=\"Bob\",primary_key='name')\n",
    "ab = Relationship(a, \"KNOWS\", b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Alice', primary_key: 5358, primary_label: 'Person'})"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.push(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_0:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "tx = graph.begin()\n",
    "tx.merge(a,\"Role\",\"name\") #node,label,primary key\n",
    "tx.merge(b,\"Person\",\"name\") #node,label,pirmary key\n",
    "tx.create(ab) #tx.merge(ab)\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.evaluate(\"MATCH (a:Person) RETURN count(a)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://gist.github.com/MarneeDear/f15693b799a6085de5653daf4e39a886\n",
    "\n",
    "https://neo4j.com/blog/py2neo-3-1-python-driver-neo4j/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
